Tekla.Structures.Drawing.EmbeddedObjectFrame
The EmbeddedObjectFrame class defines the frame object for embedded objects.

Tekla.Structures.Drawing.EmbeddedObjectFrame.Width
The width of the frame

Tekla.Structures.Drawing.EmbeddedObjectFrame.Height
The height of the frame

Tekla.Structures.Drawing.EmbeddedObjectFrame.Angle
The angle of the frame (compared to X-axis)

Tekla.Structures.Drawing.EmbeddedObjectFrame.InsertionPoint
The InsertionPoint of the frame (CenterPoint)

Tekla.Structures.Drawing.EmbeddedObjectFrame.Type
Gets the frame type (rectangular).

Tekla.Structures.Drawing.EmbeddedObjectFrame.Line
Gets or sets the line type of the frame.
Tekla.Structures.Drawing.LineTypeAttributes

Tekla.Structures.Drawing.EmbeddedObjectFrame.LineType
Deprecated, use Line instead

Tekla.Structures.Drawing.EmbeddedObjectFrame.Color
Deprecated, use Line instead

Tekla.Structures.Drawing.EmbeddedObjectFrame.GetAxisAlignedBoundingBox
Returns the bounding box of the frame in the global axis coordinate system.
Returns: The bounding box of the frame in the global axis coordinate system.

Tekla.Structures.Drawing.EmbeddedObjectFrame.GetObjectAlignedBoundingBox
Returns the bounding box of the frame in the local coordinate system.
Returns: The bounding box of the frame in the local coordinate system.

Tekla.Structures.Drawing.EmbeddedObjectFrame.Initialize
Initializes the standard values for Frame

Tekla.Structures.Drawing.EmbeddedObjectFrame.#ctor(Tekla.Structures.Drawing.LineTypes,Tekla.Structures.Drawing.DrawingColors)
Creates a new embedded object frame instance with the specified line type and color.
LineType: The line type of the frame.
FrameColor: The color of the frame.

Tekla.Structures.Drawing.EmbeddedObjectFrame.#ctor(Tekla.Structures.Drawing.LineTypes,Tekla.Structures.Drawing.TeklaDrawingColor)
Creates a new embedded object frame instance with the specified line type and user defined RGB color.
LineType: The line type of the frame.
FrameColor: The color of the frame.

Tekla.Structures.Drawing.EmbeddedObjectFrame.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.